In [1]:
import pandas as pd

In [3]:
d=pd.Series([1,2,3,4],index=["a","b","c","d"])
d

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
d["a"]

1

In [6]:
d.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
d.index=[1,2,3,4]   #now index become 1 2 3 4

In [13]:
d

1    1
2    2
3    3
4    4
dtype: int64

In [16]:
d=d.reindex(["b","c","g","l","f"])

In [17]:
d

b   NaN
c   NaN
g   NaN
l   NaN
f   NaN
dtype: float64

In [20]:
d.index=["a","b","c","d"]      #already changed

ValueError: Length mismatch: Expected axis has 5 elements, new values have 4 elements

In [32]:
d=d.reindex(["b","g","l","c","f"])
d

b   NaN
g   NaN
l   NaN
c   NaN
f   NaN
dtype: float64

In [19]:
########################## numpy to play with array

In [21]:
import numpy as np

In [22]:
l=[1,2,3,4]

In [23]:
x=np.array(l)

In [24]:
x

array([1, 2, 3, 4])

In [25]:
type(x)

numpy.ndarray

In [26]:
list(range(3,8))

[3, 4, 5, 6, 7]

In [27]:
np.arange(8)

array([0, 1, 2, 3, 4, 5, 6, 7])

In [28]:
np.arange(9).reshape(3,3)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [29]:
np.arange(9).reshape(2,3)

ValueError: cannot reshape array of size 9 into shape (2,3)

np.arange(9).reshape(9,1)

In [37]:
############ IMPORTANT **************

In [35]:
df=pd.DataFrame(np.arange(12).reshape(3,4),index=["a","b","c"],columns=["choco","munch","parle","namkeen"])

In [36]:
df

   choco  munch  parle  namkeen
a      0      1      2        3
b      4      5      6        7
c      8      9     10       11

############### DON'T STORE IN ANY VARIABLE 


########### IF WE ARE USING inplace=True

In [39]:
df=pd.DataFrame(np.arange(15).reshape(3,5),index=["a","b","c"],columns=["choco","munch","parle","namkeen","biscuit"])

In [40]:
df

   choco  munch  parle  namkeen  biscuit
a      0      1      2        3        4
b      5      6      7        8        9
c     10     11     12       13       14

In [41]:
df.drop("a")

   choco  munch  parle  namkeen  biscuit
b      5      6      7        8        9
c     10     11     12       13       14

In [48]:
df        #not a permanent chang we need to use inplace

   choco  munch  parle  namkeen  biscuit
a      0      1      2        3        4
b      5      6      7        8        9
c     10     11     12       13       14

In [43]:
df.drop("chocho")

KeyError: "['chocho'] not found in axis"

In [47]:
d2=df.drop("choco",axis=1)    #we have to tell axis =1 for droping column
d2

   munch  parle  namkeen  biscuit
a      1      2        3        4
b      6      7        8        9
c     11     12       13       14

In [46]:
##########  NOW I AM USING INPLACE = TRUE

In [55]:
df

   munch  parle  namkeen  biscuit
a      1      2        3        4
b      6      7        8        9
c     11     12       13       14

In [52]:
df

   munch  parle  namkeen  biscuit
a      1      2        3        4
b      6      7        8        9
c     11     12       13       14

In [57]:
df.drop(["parle","munch"],axis=1,inplace=True)

In [58]:
df

   namkeen  biscuit
a        3        4
b        8        9
c       13       14

In [61]:
df.mean()

namkeen    8.0
biscuit    9.0
dtype: float64

In [60]:
df.mean(1)

a     3.5
b     8.5
c    13.5
dtype: float64

In [62]:
df.mean(0)

namkeen    8.0
biscuit    9.0
dtype: float64

In [64]:
df.mean(axis="columns")

a     3.5
b     8.5
c    13.5
dtype: float64

In [73]:
s1=pd.Series([1,2,3,4],index=["a","g","e","b"])
s2=pd.Series([1,2,3,4,5],index=["a","c","d","b","g"])

In [74]:
s1

a    1
g    2
e    3
b    4
dtype: int64

In [75]:
s2

a    1
c    2
d    3
b    4
g    5
dtype: int64

In [76]:
s1+s2

a    2.0
b    8.0
c    NaN
d    NaN
e    NaN
g    7.0
dtype: float64

In [82]:
c1=pd.DataFrame(np.arange(12).reshape(4,3),index=["Adi","Abhi","ayu","Adhar"],columns=["pen","copy","marker"])
c2=pd.DataFrame(np.arange(12).reshape(3,4),index=["Adi","Abhi","ayu"],columns=["pen","copy","marker","pencil"])

In [83]:
c1

       pen  copy  marker
Adi      0     1       2
Abhi     3     4       5
ayu      6     7       8
Adhar    9    10      11

In [84]:
c2

      pen  copy  marker  pencil
Adi     0     1       2       3
Abhi    4     5       6       7
ayu     8     9      10      11

In [81]:
c1+c2

       copy  marker   pen  pencil
Abhi    9.0    11.0   7.0     NaN
Adhar   NaN     NaN   NaN     NaN
Adi     2.0     4.0   0.0     NaN
ayu    16.0    18.0  14.0     NaN

In [85]:
c3=pd.DataFrame(np.arange(12).reshape(4,3),index=list("ABCD"),columns=["pen","copy","marker"])
c4=pd.DataFrame(np.arange(12).reshape(3,4),index=list("ABC"),columns=["pen","copy","marker","pencil"])

In [86]:
c3

   pen  copy  marker
A    0     1       2
B    3     4       5
C    6     7       8
D    9    10      11

In [89]:
c4

   pen  copy  marker  pencil
A    0     1       2       3
B    4     5       6       7
C    8     9      10      11

In [90]:
c3+c4

   copy  marker   pen  pencil
A   2.0     4.0   0.0     NaN
B   9.0    11.0   7.0     NaN
C  16.0    18.0  14.0     NaN
D   NaN     NaN   NaN     NaN

In [91]:
c3=pd.DataFrame(np.arange(12).reshape(4,3),index=list("BCDE"),columns=["pen","copy","marker"])
c4=pd.DataFrame(np.arange(12).reshape(3,4),index=list("ABD"),columns=["pen","copy","marker","pencil"])

In [93]:
c3

   pen  copy  marker
B    0     1       2
C    3     4       5
D    6     7       8
E    9    10      11

In [94]:
c4

   pen  copy  marker  pencil
A    0     1       2       3
B    4     5       6       7
D    8     9      10      11

In [95]:
c3=pd.DataFrame(np.arange(12).reshape(4,3),index=range(3,7),columns=["pen","copy","marker"])
c4=pd.DataFrame(np.arange(12).reshape(3,4),index=range(4,7),columns=["pen","copy","marker","pencil"])

In [96]:
c3

   pen  copy  marker
3    0     1       2
4    3     4       5
5    6     7       8
6    9    10      11

In [97]:
c4

   pen  copy  marker  pencil
4    0     1       2       3
5    4     5       6       7
6    8     9      10      11

In [101]:
c3=c3+c4

In [103]:
c3

   copy  marker   pen  pencil
3   NaN     NaN   NaN     NaN
4   5.0     7.0   3.0     NaN
5  12.0    14.0  10.0     NaN
6  19.0    21.0  17.0     NaN

In [104]:
c3+c4

   copy  marker   pen  pencil
3   NaN     NaN   NaN     NaN
4   6.0     9.0   3.0     NaN
5  17.0    20.0  14.0     NaN
6  28.0    31.0  25.0     NaN

In [105]:
c3.add(c4)

   copy  marker   pen  pencil
3   NaN     NaN   NaN     NaN
4   6.0     9.0   3.0     NaN
5  17.0    20.0  14.0     NaN
6  28.0    31.0  25.0     NaN

In [109]:
c3.add(c4,fill_value=0) #aisa pos jaha pe dono data me kuchh na ho waha pe fill kaam aayega agar ek me data hai dusre me nhi to is baar add kr dega phle nan kr deta tha

   copy  marker   pen  pencil
3   NaN     NaN   NaN     NaN
4   6.0     9.0   3.0     3.0
5  17.0    20.0  14.0     7.0
6  28.0    31.0  25.0    11.0

In [110]:
c3=pd.DataFrame(np.arange(12).reshape(4,3),index=list("BCDE"),columns=["pen","copy","marker"])
c4=pd.DataFrame(np.arange(12).reshape(3,4),index=list("ABD"),columns=["pen","copy","marker","pencil"])

In [112]:
c3

   pen  copy  marker
B    0     1       2
C    3     4       5
D    6     7       8
E    9    10      11

In [113]:
c4

   pen  copy  marker  pencil
A    0     1       2       3
B    4     5       6       7
D    8     9      10      11

In [114]:
c3+c4

   copy  marker   pen  pencil
A   NaN     NaN   NaN     NaN
B   6.0     8.0   4.0     NaN
C   NaN     NaN   NaN     NaN
D  16.0    18.0  14.0     NaN
E   NaN     NaN   NaN     NaN

In [115]:
c3*3

   pen  copy  marker
B    0     3       6
C    9    12      15
D   18    21      24
E   27    30      33

In [116]:
c3

   pen  copy  marker
B    0     1       2
C    3     4       5
D    6     7       8
E    9    10      11

In [117]:
c3.add(c4)

   copy  marker   pen  pencil
A   NaN     NaN   NaN     NaN
B   6.0     8.0   4.0     NaN
C   NaN     NaN   NaN     NaN
D  16.0    18.0  14.0     NaN
E   NaN     NaN   NaN     NaN

In [119]:
c3.add(c4,fill_value=0)           # aisa data jo dono me hi nhi waha nan baki ek me dusre me nhi to usko zero bana ke add kr dega

   copy  marker   pen  pencil
A   1.0     2.0   0.0     3.0
B   6.0     8.0   4.0     7.0
C   4.0     5.0   3.0     NaN
D  16.0    18.0  14.0    11.0
E  10.0    11.0   9.0     NaN

In [120]:
c3=pd.DataFrame(np.arange(12).reshape(4,3),index=list("BECD"),columns=["pen","copy","marker"])
c4=pd.DataFrame(np.arange(12).reshape(3,4),index=list("DAB"),columns=["pen","copy","marker","pencil"])

In [121]:
c3

   pen  copy  marker
B    0     1       2
E    3     4       5
C    6     7       8
D    9    10      11

In [122]:
c3.sort_index()

   pen  copy  marker
B    0     1       2
C    6     7       8
D    9    10      11
E    3     4       5

In [123]:
c3.sort_index(ascending=False)

   pen  copy  marker
E    3     4       5
D    9    10      11
C    6     7       8
B    0     1       2

In [126]:
c3.sort_index(axis=1)           #copy ka c then m then p

   copy  marker  pen
B     1       2    0
E     4       5    3
C     7       8    6
D    10      11    9

In [138]:
c3=pd.DataFrame([[3,-2,5],[4,1,5],[9,6,1],[0,-3,2]],index=list("BECD"),columns=["pen","copy","marker"])
c4=pd.DataFrame(np.arange(12).reshape(3,4),index=list("DAB"),columns=["pen","copy","marker","pencil"])

In [137]:
c3

   pen  copy  marker
B    3    -2       5
E    4     1       5
C    9     6       1
D    0    -3       2

In [140]:
c3.sort_index()

   pen  copy  marker
B    3    -2       5
C    9     6       1
D    0    -3       2
E    4     1       5

In [141]:
c3

   pen  copy  marker
B    3    -2       5
E    4     1       5
C    9     6       1
D    0    -3       2

In [142]:
c3.sort_index(by="copy")

TypeError: DataFrame.sort_index() got an unexpected keyword argument 'by'

In [143]:
##ye sikhana hai

In [144]:
data=pd.read_csv("Desktop/DAPython/DA_NOTES/Pandas/cardekho_dataset.csv")

In [145]:
data

,Unnamed: 0,car_name,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,0,Maruti Alto,Maruti,Alto,9,120000,Individual,Petrol,Manual,19.70,796,46.30,5,120000
1,1,Hyundai Grand,Hyundai,Grand,5,20000,Individual,Petrol,Manual,18.90,1197,82.00,5,550000
2,2,Hyundai i20,Hyundai,i20,11,60000,Individual,Petrol,Manual,17.00,1197,80.00,5,215000
3,3,Maruti Alto,Maruti,Alto,9,37000,Individual,Petrol,Manual,20.92,998,67.10,5,226000
4,4,Ford Ecosport,Ford,Ecosport,6,30000,Dealer,Diesel,Manual,22.77,1498,98.59,5,570000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15406,19537,Hyundai i10,Hyundai,i10,9,10723,Dealer,Petrol,Manual,19.81,1086,68.05,5,250000
15407,19540,Maruti Ertiga,Maruti,Ertiga,2,18000,Dealer,Petrol,Manual,17.50,1373,91.10,7,925000
15408,19541,Skoda Rapid,Skoda,Rapid,6,67000,Dealer,Diesel,Manual,21.14,1498,103.52,5,425000
15409,19542,Mahindra XUV500,Mahindra,XUV500,5,3800000,Dealer,Diesel,Manual,16.00,2179,140.00,7,1225000
15410,19543,Honda City,Honda,City,2,13000,Dealer,Petrol,Automatic,18.00,1497,117.60,5,1200000

In [171]:
data.brand.value_counts()

brand
Maruti           4992
Hyundai          2982
Honda            1485
Mahindra         1011
Toyota            793
Ford              790
Volkswagen        620
Renault           536
BMW               439
Tata              430
Mercedes-Benz     337
Skoda             334
Audi              192
Datsun            170
Jaguar             59
Land Rover         51
Jeep               41
Kia                32
Porsche            21
Volvo              20
MG                 19
Mini               17
Nissan             11
Lexus              10
Isuzu               8
Bentley             3
Maserati            2
ISUZU               2
Ferrari             1
Mercedes-AMG        1
Rolls-Royce         1
Force               1
Name: count, dtype: int64

In [155]:
dataA=pd.crosstab(data.brand,data.fuel_type)
dataA

fuel_type      CNG  Diesel  Electric  LPG  Petrol
brand
Audi             0     170         0    0      22
BMW              0     395         0    0      44
Bentley          0       0         0    0       3
Datsun           0       0         0    0     170
Ferrari          0       0         0    0       1
Force            0       1         0    0       0
Ford             0     540         0    0     250
Honda            2     463         0    0    1020
Hyundai         12    1056         0   13    1901
ISUZU            0       2         0    0       0
Isuzu            0       8         0    0       0
Jaguar           0      56         0    0       3
Jeep             0      26         0    0      15
Kia              0      14         0    0      18
Land Rover       0      48         0    0       3
Lexus            0       0         0    0      10
MG               0       7         0    0      12
Mahindra         1     956         0    0      54
Maruti         284    1698         0   31    2979
Maserati         0       2         0    0       0
Mercedes-AMG     0       0         0    0       1
Mercedes-Benz    0     249         0    0      88
Mini             0       7         0    0      10
Nissan           0       7         0    0       4
Porsche          0      15         0    0       6
Renault          0     209         0    0     327
Rolls-Royce      0       0         0    0       1
Skoda            0     196         0    0     138
Tata             0     255         0    0     175
Toyota           2     712         4    0      75
Volkswagen       0     307         0    0     313
Volvo            0      20         0    0       0

In [158]:
dataA=pd.crosstab(data.brand,data.transmission_type)

In [159]:
dataA

transmission_type  Automatic  Manual
brand
Audi                     192       0
BMW                      439       0
Bentley                    3       0
Datsun                    10     160
Ferrari                    1       0
Force                      0       1
Ford                      85     705
Honda                    288    1197
Hyundai                  386    2596
ISUZU                      2       0
Isuzu                      1       7
Jaguar                    59       0
Jeep                      11      30
Kia                       13      19
Land Rover                51       0
Lexus                     10       0
MG                         8      11
Mahindra                  74     937
Maruti                   526    4466
Maserati                   2       0
Mercedes-AMG               1       0
Mercedes-Benz            323      14
Mini                      17       0
Nissan                     1      10
Porsche                   21       0
Renault                   65     471
Rolls-Royce                1       0
Skoda                    183     151
Tata                      46     384
Toyota                   213     580
Volkswagen               136     484
Volvo                     18       2

In [160]:
dataA=pd.crosstab(data.transmission_type,data.fuel_type)

In [161]:
dataA

fuel_type          CNG  Diesel  Electric  LPG  Petrol
transmission_type
Automatic            0    1634         4    0    1548
Manual             301    5785         0   44    6095

In [165]:
dataA=pd.crosstab(data.brand,data.seats,margins=True)

In [166]:
dataA

seats          0  2   4      5    6     7    8   9    All
brand
Audi           0  0   1    168    0    23    0   0    192
BMW            0  6  33    399    0     1    0   0    439
Bentley        0  0   2      1    0     0    0   0      3
Datsun         0  0   0    127    0    43    0   0    170
Ferrari        0  0   1      0    0     0    0   0      1
Force          0  0   0      1    0     0    0   0      1
Ford           0  0   0    743    0    47    0   0    790
Honda          1  0   0   1483    0     1    0   0   1485
Hyundai        0  0   0   2982    0     0    0   0   2982
ISUZU          0  0   0      0    0     2    0   0      2
Isuzu          0  0   0      7    0     1    0   0      8
Jaguar         0  0   0     59    0     0    0   0     59
Jeep           0  0   0     41    0     0    0   0     41
Kia            0  0   0     28    0     3    0   1     32
Land Rover     0  0   1     31    1    18    0   0     51
Lexus          0  0   0     10    0     0    0   0     10
MG             0  0   0     19    0     0    0   0     19
Mahindra       0  0   0     43  119   700   95  54   1011
Maruti         0  0  18   4598    7   369    0   0   4992
Maserati       0  0   0      2    0     0    0   0      2
Mercedes-AMG   0  0   0      1    0     0    0   0      1
Mercedes-Benz  0  1   9    292    0    35    0   0    337
Mini           0  0   6     11    0     0    0   0     17
Nissan         1  0   0     10    0     0    0   0     11
Porsche        0  0   3     18    0     0    0   0     21
Renault        0  0   0    524    0    12    0   0    536
Rolls-Royce    0  0   1      0    0     0    0   0      1
Skoda          0  0   0    334    0     0    0   0    334
Tata           0  0   0    290    0   140    0   0    430
Toyota         0  0   0     61    0   516  216   0    793
Volkswagen     0  0   2    618    0     0    0   0    620
Volvo          0  0   0      9    0    11    0   0     20
All            2  7  77  12910  127  1922  311  55  15411

In [167]:
data.brand.describe()

count      15411
unique        32
top       Maruti
freq        4992
Name: brand, dtype: object

In [169]:
data.seats.describe()

count    15411.000000
mean         5.325482
std          0.807628
min          0.000000
25%          5.000000
50%          5.000000
75%          5.000000
max          9.000000
Name: seats, dtype: float64